# Cole Weber
## Week 12 - 4/9/2021
### Python - Pandas Series

In [5]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
s = Series([2, 5, 7, -9, 5, 4, 3])
s.values

array([ 2,  5,  7, -9,  5,  4,  3], dtype=int64)

In [7]:
s.index

RangeIndex(start=0, stop=7, step=1)

In [12]:
summer_olympic = Series ([2520, 1152, 937, 847, 713], index = ['USA', 'Russia', 'Germany', 'UK', 'France'])

summer_olympic

USA        2520
Russia     1152
Germany     937
UK          847
France      713
dtype: int64

In [14]:
'USA' in summer_olympic

True

In [15]:
summer_olym_dict = summer_olympic.to_dict()
summer_olym_dict
summer_olympic_series = Series(summer_olym_dict)
summer_olympic_series

USA        2520
Russia     1152
Germany     937
UK          847
France      713
dtype: int64

In [16]:
countries = ['Russia', 'France', 'UK', 'Germany', 'Turkey', 'USA']
series2 = Series (summer_olym_dict, index = countries)
series2

Russia     1152.0
France      713.0
UK          847.0
Germany     937.0
Turkey        NaN
USA        2520.0
dtype: float64

In [17]:
pd.isnull(series2)

Russia     False
France     False
UK         False
Germany    False
Turkey      True
USA        False
dtype: bool

In [18]:
pd.notnull(series2)

Russia      True
France      True
UK          True
Germany     True
Turkey     False
USA         True
dtype: bool

In [19]:
summer_olympic + series2

France     1426.0
Germany    1874.0
Russia     2304.0
Turkey        NaN
UK         1694.0
USA        5040.0
dtype: float64

In [20]:
# DataFrame

data_dict = {'States': ["Colorado", "California", "Florida"],
             'Year': [2000, 2001, 2002],
             'Pop': [1.5, 3.6, 2.4]}
df = pd.DataFrame(data_dict)
df

       States  Year  Pop
0    Colorado  2000  1.5
1  California  2001  3.6
2     Florida  2002  2.4

In [21]:
pd.DataFrame(data_dict, columns = ["Year", "States", "Pop"])

   Year      States  Pop
0  2000    Colorado  1.5
1  2001  California  3.6
2  2002     Florida  2.4

In [22]:
df2 = pd.DataFrame(data_dict, columns = ["Year", "States", "Pop", "Age"], index = [1, 2, 3])
df2

   Year      States  Pop  Age
1  2000    Colorado  1.5  NaN
2  2001  California  3.6  NaN
3  2002     Florida  2.4  NaN

In [23]:
df2.columns

Index(['Year', 'States', 'Pop', 'Age'], dtype='object')

In [24]:
del df2['Pop']

In [25]:
df2.loc[1]
df2

   Year      States  Age
1  2000    Colorado  NaN
2  2001  California  NaN
3  2002     Florida  NaN

In [26]:
df2["Age"] = np.arange(22, 22 + 3)
df2

   Year      States  Age
1  2000    Colorado   22
2  2001  California   23
3  2002     Florida   24

In [29]:
df2.index.name = 'row'; df2.columns.name = 'state'
df2

state  Year      States  Age
row
1      2000    Colorado   22
2      2001  California   23
3      2002     Florida   24